MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FV08KM204/mcu.h
extern volatile CCP5STATBITS CCP5STATbits __attribute__((__sfr__));

#define CCP5STATL CCP5STATL
extern volatile uint16_t CCP5STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP5STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP5STATLBITS;
extern volatile CCP5STATLBITS CCP5STATLbits __attribute__((__sfr__));

#define CCP5TMRL CCP5TMRL
extern volatile uint16_t CCP5TMRL __attribute__((__sfr__));
#define CCP5TMRH CCP5TMRH
extern volatile uint16_t CCP5TMRH __attribute__((__sfr__));
#define CCP5PRL CCP5PRL
extern volatile uint16_t CCP5PRL __attribute__((__sfr__));
#define CCP5PRH CCP5PRH
extern volatile uint16_t CCP5PRH __attribute__((__sfr__));
#define CCP5RA CCP5RA
extern volatile uint16_t CCP5RA __attribute__((__sfr__));
#define CCP5RAL CCP5RAL
extern volatile uint16_t CCP5RAL __attribute__((__sfr__));
#define CCP5RB CCP5RB
extern volatile uint16_t CCP5RB __attribute__((__sfr__));
#define CCP5RBL CCP5RBL
extern volatile uint16_t CCP5RBL __attribute__((__sfr__));
#define CCP5BUFL CCP5BUFL
extern volatile uint16_t CCP5BUFL __attribute__((__sfr__));
#define CCP5BUFH CCP5BUFH
extern volatile uint16_t CCP5BUFH __attribute__((__sfr__));
#define SPI1BUF SPI1BUF
extern volatile uint16_t SPI1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSPI1BUFBITS {
  union {
    struct {
      uint16_t SSPBUF:8;
    };
    struct {
      uint16_t SPI1BUF:8;
    };
  };
} SPI1BUFBITS;
extern volatile SPI1BUFBITS SPI1BUFbits __attribute__((__sfr__));

#define SSP1BUF SSP1BUF
extern volatile uint16_t SSP1BUF __attribute__((__sfr__));
__extension__ typedef struct tagSSP1BUFBITS {
  union {
    struct {
      uint16_t SSPBUF:8;
    };
    struct {
      uint16_t SPI1BUF:8;
    };
  };
} SSP1BUFBITS;
extern volatile SSP1BUFBITS SSP1BUFbits __attribute__((__sfr__));

#define SSP1CON1 SSP1CON1
extern volatile uint16_t SSP1CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON1BITS {
  union {
    struct {
      uint16_t SSPM:4;
      uint16_t CKP:1;
      uint16_t SSPEN:1;
      uint16_t SSPOV:1;
      uint16_t WCOL:1;
    };
    struct {
      uint16_t SSPM0:1;
      uint16_t SSPM1:1;
      uint16_t SSPM2:1;
      uint16_t SSPM3:1;
    };
  };
} SSP1CON1BITS;
extern volatile SSP1CON1BITS SSP1CON1bits __attribute__((__sfr__));

#define SSP1CON2 SSP1CON2
extern volatile uint16_t SSP1CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSSP1CON2BITS {
  union {
    struct {
      uint16_t SEN:1;
      uint16_t RSEN:1;
      uint16_t PEN:1;
      uint16_t RCEN:1;
      uint16_t ACKEN:1;
      uint16_t ACKDT:1;
      uint16_t ACKSTAT:1;
      uint16_t GCEN:1;
    };
    struct {
      uint16_t :1;
      uint16_t ADMSK:5;
    };
    struct {
      uint16_t :1;
      uint16_t ADMSK1:1;
      uint16_t ADMSK2:1;
      uint16_t ADMSK3:1;
      uint16_t ADMSK4:1;
      uint16_t ADMSK5:1;
    };
  };
} SSP1CON2BITS;
extern volatile SSP1CON2BITS SSP1CON2bits __attribute__((__sfr__));

#define SSP1CON3 SSP1CON3
extern volatile uint16_t SSP1CON3 __attribute__((__sfr__));
typedef struct tagSSP1CON3BITS {
  uint16_t DHEN:1;
  uint16_t AHEN:1;
  uint16_t SBCDE:1;
  uint16_t SDAHT:1;
  uint16_t BOEN:1;
  uint16_t SCIE:1;
  uint16_t PCIE:1;
  uint16_t ACKTIM:1;
} SSP1CON3BITS;
extern volatile SSP1CON3BITS SSP1CON3bits __attribute__((__sfr__));

#define SSP1STAT SSP1STAT
extern volatile uint16_t SSP1STAT __attribute__((__sfr__));
__extension__ typedef struct tagSSP1STATBITS {
  union {
    struct {
      uint16_t BF:1;
      uint16_t UA:1;
      uint16_t R_NOT_W:1;
      uint16_t S:1;
      uint16_t P:1;
      uint16_t D_NOT_A:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
    };
    struct {
      uint16_t :2;
      uint16_t R_W:1;
      uint16_t :2;
      uint16_t D_A:1;
    };
    struct {
      uint16_t :2;
      uint16_t NOT_W:1;
      uint16_t :2;
      uint16_t NOT_A:1;
    };
    struct {
      uint16_t :2;
      uint16_t NOT_WRITE:1;
      uint16_t :2;
      uint16_t NOT_ADDRESS:1;
    };
    struct {
      uint16_t :2;
      uint16_t READ_WRITE:1;
      uint16_t :2;
      uint16_t DATA_ADDRESS:1;
    };
    struct {
      uint16_t :2;
      uint16_t I2C_READ:1;
      uint16_t I2C_START:1;
      uint16_t I2C_STOP:1;
      uint16_t I2C_DAT:1;
    };
  };
} SSP1STATBITS;
extern volatile SSP1STATBITS SSP1STATbits __attribute__((__sfr__));

#define I2C1ADD I2C1ADD
extern volatile uint16_t I2C1ADD __attribute__((__sfr__));
__extension__ typedef struct tagI2C1ADDBITS {
  union {
    struct {
      uint16_t SSPADD:8;
    };
    struct {
      uint16_t I2CADD:8;
    };
  };
} I2C1ADDBITS;
extern volatile I2C1ADDBITS I2C1ADDbits __attribute__((__sfr__));

#define I2C1BRG I2C1BRG
extern volatile uint16_t I2C1BRG __attribute__((__sfr__));
__extension__ typedef struct tagI2C1BRGBITS {
  union {
    struct {
      uint16_t SSPADD:8;
    };
    struct {
      uint16_t I2CADD:8;
    };
  };
} I2C1BRGBITS;
extern volatile I2C1BRGBITS I2C1BRGbits __attribute__((__sfr__));

#define SSP1ADD SSP1ADD
extern volatile uint16_t SSP1ADD __attribute__((__sfr__));
__extension__ typedef struct tagSSP1ADDBITS {
  union {
    struct {
      uint16_t SSPADD:8;
    };
    struct {
      uint16_t I2CADD:8;
    };
  };
} SSP1ADDBITS;
extern volatile SSP1ADDBITS SSP1ADDbits __attribute__((__sfr__));

#define SSP1BRG SSP1BRG
extern volatile uint16_t SSP1BRG __attribute__((__sfr__));
__extension__ typedef struct tagSSP1BRGBITS {
  union {
    struct {
      uint16_t SSPADD:8;
    };
    struct {
      uint16_t I2CADD:8;
    };
  };
} SSP1BRGBITS;
extern volatile SSP1BRGBITS SSP1BRGbits __attribute__((__sfr__));

#define I2C1MSK I2C1MSK
extern volatile uint16_t I2C1MSK __attribute__((__sfr__));
__extension__ typedef struct tagI2C1MSKBITS {
  union {
    struct {
      uint16_t MSK0:1;
      uint16_t MSK1:1;
      uint16_t MSK2:1;
      uint16_t MSK3:1;
      uint16_t MSK4:1;
      uint16_t MSK5:1;
      uint16_t MSK6:1;
      uint16_t MSK7:1;
    };
    struct {
      uint16_t AMSK:8;
    };
  };
} I2C1MSKBITS;
